// Функция alert 
alert('Привет всем');
// принимает один параметр
// выдает всплывающее окно 


// функция prompt
prompt();
// Выдает поле для ввода информации
// Можно вызывать без параметров
// можно передать параметры:
// 1.Заголовок к тексту
// 2.Значение по умолчанию в поле
let p = prompt('Сколько', 2);
alert("Сколько " + p);


// функция confirm;
confirm();
// выводит окно с вопросом - ответ
// ок или отмена;
// true или false;
p = confirm("Да?")
// принимает либо один параметр
// либо параметр можно не указывать